# 문자열 출력하기
str = input()
print(str)

# a와 b 출력하기
a, b = map(int, input().strip().split(' '))
print('a =', a)
print('b =', b)

# 문자열 반복해서 출력하기
a, b = input().strip().split(' ')
b = int(b)
print(a * b)

# 대소문자 바꿔서 출력하기


# 특수문자 출력하기


# 덧셈식 출력하기


# 문자열 붙여서 출력하기


# 문자열 돌리기

	
# 특수문자 출력하기


# 덧셈식 출력하기


# 문자열 붙여서 출력하기


# 문자열 돌리기


# 홀짝 구분하기


# 문자열 겹쳐쓰기


# 문자열 섞기


# 문자 리스트를 문자열로 변환하기


# 문자열 곱하기


# 더 크게 합치기


# 두 수의 연산값 비교하기


# n의 배수


# 공배수


# 홀짝에 따라 다른 값 반환하기


# 조건 문자열


# flag에 따라 다른 값 반환하기